code-review/NRB_3471_3546/База_Было/InformationRegisters/КатегорииРолейКлиентовСогласноУказов81и95.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КатегорииРолейКлиентовСогласноУказов81и95</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КатегорияРоли</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРолейКлиентовСогласноУказов81и95</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/КатегорииРолейКлиентовСогласноУказов81и95/Ext/ManagerModule.bsl
// Возвращает категорию роли клиента на указанную дату
//
// Параметры:
//  Клиент	 - СправочникСсылка.Контрагенты
//  Дата	 - Дата
// 
// Возвращаемое значение:
//  СправочникСсылка.КатегорииРолейКлиентовСогласноУказов81и95 - Категория роли клиента на дату
//
Функция КатегорияРолиКлиента(Клиент, Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КатегорииРолейКлиентовСогласноУказов81и95СрезПоследних.КатегорияРоли КАК КатегорияРоли
	|ИЗ
	|	РегистрСведений.КатегорииРолейКлиентовСогласноУказов81и95.СрезПоследних(
	|			&Дата,
	|			ЮрФизЛицо В
	|				(ВЫБРАТЬ
	|					Контрагенты.ЮридическиеФизическиеЛица КАК ЮридическиеФизическиеЛица
	|				ИЗ
	|					Справочник.Контрагенты КАК Контрагенты
	|				ГДЕ
	|					Контрагенты.Ссылка = &Клиент)) КАК КатегорииРолейКлиентовСогласноУказов81и95СрезПоследних";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.КатегорияРоли;
	КонецЕсли;
	
КонецФункции
